zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеОкладовЗаВоинскиеСпециальныеЗвания</name>
  <registerRecords>InformationRegister.ОкладыПоВоинскимСпециальнымЗваниям</registerRecords>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оклады</name>
    <attributes>
      <name>ВоинскоеСпециальноеЗвание</name>
      <type>
        <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	ВоинскиеСпециальныеЗвания.СформироватьДвиженияОкладовПоВоинскимСпециальнымЗваниям(Движения, ДанныеДляПроведения.ОкладыПоВоинскимСпециальнымЗваниям);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаВступленияВСилу, "Объект.ДатаВступленияВСилу", Отказ, НСтр("ru='Дата вступления в силу'"), , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УтверждениеОкладовЗаВоинскиеСпециальныеЗванияОклады.Ссылка.ДатаВступленияВСилу КАК Период,
	               |	УтверждениеОкладовЗаВоинскиеСпециальныеЗванияОклады.ВоинскоеСпециальноеЗвание,
	               |	УтверждениеОкладовЗаВоинскиеСпециальныеЗванияОклады.Размер
	               |ИЗ
	               |	Документ.УтверждениеОкладовЗаВоинскиеСпециальныеЗвания.Оклады КАК УтверждениеОкладовЗаВоинскиеСпециальныеЗванияОклады
	               |ГДЕ
	               |	УтверждениеОкладовЗаВоинскиеСпециальныеЗванияОклады.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПроведения = Новый Структура;
	
	ОкладыПоВоинскимСпециальнымЗваниям = РезультатЗапроса.Выгрузить();
	ДанныеДляПроведения.Вставить("ОкладыПоВоинскимСпециальнымЗваниям", ОкладыПоВоинскимСпециальнымЗваниям);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
